Repository: ekimovalex27/SolutionDashboardMining
Catalog: DashboardMining/Strings/*/Resources.resw
Source language: en_us
Languages: ru

# Dashboard.Header
source: Dashboard
ru: Панель мониторинга

# Dashboard_CheckManual.Label
source: Manual check
ru: Ручная проверка

# Dashboard_CheckStart.Label
source: Run check
ru: Запустить проверку

# Dashboard_CheckStop.Label
source: Stop check
ru: Остановить проверку

# Dashboard_Column_Group.Text
source: Group
ru: Группа

# Dashboard_Column_Name.Text
source: Name
ru: Имя

# Dashboard_Column_State.Text
source: State
ru: Состояние

# Dashboard_Column_VideocardFan.Text
source: Video card Fan
ru: Вентиляторы видеокарт

# Dashboard_Column_VideocardSpeed.Text
source: Video card Speed
ru: Скорость видеокарт

# Dashboard_Column_VideocardTemp.Text
source: Video card Temp
ru: Температура видеокарт

# Dashboard_Result.Text
source: Condition check result
ru: Результат проверки условий

# Event.Header
source: Events
ru: Журнал

# Event_Clear.Label
source: Clear all
ru: Очистить все

# Event_Column_Action.Text
source: Action
ru: Действие

# Event_Column_Date.Text
source: Date
ru: Дата

# Event_Column_Details.Text
source: Details
ru: Детали

# Event_Column_During.Text
source: During
ru: В течении

# Event_Column_Group.Text
source: Group
ru: Группа

# Event_Column_Name.Text
source: Name
ru: Имя

# Event_Column_Problem.Text
source: Problem
ru: Проблема

# Event_Copy.Label
source: Copy selected
ru: Копировать отмеченное

# Event_Delete.Label
source: Delete selected
ru: Удалить отмеченное

# Main_BottomAppBar_CheckLast.Text
source: Last check
ru: Последняя проверка

# Main_BottomAppBar_CheckLastNotPerformed
source: Not performed
ru: Не проводилась

# Main_BottomAppBar_CheckRemain.Text
source: Remain to check
ru: Осталось до проверки

# Main_BottomAppBar_CountFarm.Text
source: Count Farms
ru: Количество ферм

# Main_BottomAppBar_Seconds.Text
source: sec.
ru: сек.

# Main_BottomAppBar_Uptime.Text
source: Uptime Dashboard
ru: Время работы Панели мониторинга

# Settings.Header
source: Settings
ru: Настройки

# Settings_cmdGetDefault.Content
source: Set defaults
ru: Установить значения по-умолчанию

# Settings_Column_Action.Text
source: Action
ru: Действие

# Settings_Column_Condition.Text
source: Condition
ru: Условие

# Settings_Column_Duration.Text
source: Duration
ru: В течении

# Settings_Column_Parameter.Text
source: Parameter
ru: Параметр

# Settings_FarmNotAvailable.Text
source: Farm not available
ru: Ферма недоступна

# Settings_lblCheckDelay.Text
source: Farms check interval
ru: Интервал проверки ферм

# Settings_lblCheckNotification.Text
source: Notification recurrence interval about problem
ru: Интервал повторного уведомления о проблеме

# Settings_lblCheckRestart.Text
source: Farm restart duration
ru: Длительность перезагрузки фермы

# Settings_lblCountResetRestart.Text
source: Reset the reboot counter after
ru: Сброс счётчика перезагрузок через

# Settings_lblCountRestart.Text
source: Number of restarts
ru: Количество перезагрузок подряд

# Time_Days
source: d.
ru: дн.

# Time_Days_XML.Text
source: d.
ru: дн.

# Time_Hours
source: h.
ru: час.

# Time_Hours_XML.Text
source: h.
ru: час.

# Time_Minutes
source: min.
ru: мин.

# Time_Minutes_XML.Text
source: min.
ru: мин.

# Time_Seconds
source: sec.
ru: сек.

# Time_Seconds_XML.Text
source: sec.
ru: сек.

# About.Header
source: About
ru: О программе

# About_Application.Text
source: BRIEF
ru: КРАТКО

# About_ApplicationText.Text
source: Dashboard Mining increases mining profitability by increasing the efficiency of mining farms and reducing downtime
ru: Dashboard Mining увеличивает доходность майнинга за счёт повышения эффективности работы майнинговых ферм и уменьшения времени их простоя

# About_Author.Text
source: AUTHORS
ru: АВТОРЫ

# About_Brief.Text
source: DESCRIPTION
ru: ВОЗМОЖНОСТИ

# About_Brief01.Text
source: Dashboard Mining shows the visual information about farms: names and groups, availability, IP-addresses, speed of video cards, temperature of video cards, parameters of the fan on the video card. You can sort the information by any column.
ru: Dashboard Mining показывает наглядную информацию о фермах: имена и группы, доступность, IP-адреса, скорость видеокарт, температура видеокарт, параметры вентилятора на видеокарте. Можно сортировать информацию по любому столбцу.

# About_Brief02.Text
source: It is possible to use multiple accounts at the same time.
ru: Есть возможность использовать одновременно несколько учётных записей.

# About_Brief03.Text
source: You can check the following conditions:
ru: Вы можете проверять следующие условия:

# About_Brief04.Text
source: - Availability of farms
ru: - Доступность ферм

# About_Brief05.Text
source: - Speed of video cards
ru: - Скорость видеокарт

# About_Brief06.Text
source: - Temperature of video cards
ru: - Температура видеокарт

# About_Brief07.Text
source: - Fan parameters on the video card
ru: - Параметры вентилятора на видеокарте

# About_Brief08.Text
source: When conditions occur, the following actions are performed:
ru: При срабатывании условий выполняются действия:

# About_Brief09.Text
source: - Event Logging
ru: - Журналирование события

# About_Brief10.Text
source: - Event notification
ru: - Уведомление о событии

# About_Brief11.Text
source: - Reboot The Farm
ru: - Перезагрузка фермы

# About_Brief12.Text
source: Event Notification:
ru: Уведомление о событии:

# About_Brief13.Text
source: - Application Log
ru: - Журнал приложения

# About_Brief14.Text
source: - Telegram Bot
ru: - Бот Telegram

# About_Brief15.Text
source: Application Log
ru: Журнал приложения:

# About_Brief16.Text
source: - Application events are saved
ru: - События приложения сохраняются

# About_Brief17.Text
source: - You can export events in CSV format for analysis
ru: - Вы можете экспортировать события в формате csv для анализа

# About_Brief18.Text
source: - Event analysis will find a 'bottleneck' and reduce farm downtime
ru: - Анализ событий позволит найти 'узкое место' и уменьшить время простоя фермы

# About_Brief19.Text
source: Dashboard Mining applies to the site https://simplemining.net (Copyright © 2018 SimpleMining.net All rights reserved.)
ru: Dashboard Mining применяется для сайта https://simplemining.net (Copyright © 2018 SimpleMining.net All rights reserved.)

# About_Brief20.Text
source: Dashboard Mining tested for miner 'Claymore-eth-v 10.0'
ru: Dashboard Mining протестировано для майнера 'claymore-eth-v10.0'.

# About_Design.Text
source: AUTHOR LOGO
ru: АВТОР ЛОГОТИПА

# About_Resource.Text
source: USED RESOURCES
ru: ИСПОЛЬЗУЕМЫЕ РЕСУРСЫ

# About_Support.Text
source: SUPPORT
ru: ПОДДЕРЖКА

# Login.Header
source: Login
ru: Вход

# Login_cmdGetCaptcha0.Content
source: Get Captcha
ru: Капча

# Login_cmdGetCaptcha1.Content
source: Get Captcha
ru: Капча

# Login_cmdLogin0.Content
source: Login
ru: Войти

# Login_cmdLogin1.Content
source: Login
ru: Войти

# Login_cmdLogout0.Content
source: Logout
ru: Выйти

# Login_cmdLogout1.Content
source: Logout
ru: Выйти

# Login_lblErrorpswPassword0.Text
source: Field must not be empty
ru: Поле не должно быть пустым

# Login_lblErrorpswPassword1.Text
source: Field must not be empty
ru: Поле не должно быть пустым

# Login_lblErrortxtLogin0.Text
source: Field must not be empty
ru: Поле не должно быть пустым

# Login_lblErrortxtLogin1.Text
source: Field must not be empty
ru: Поле не должно быть пустым

# Login_pswPassword0.Header
source: Password
ru: Пароль

# Login_pswPassword1.Header
source: Password
ru: Пароль

# Login_txtCaptcha0.Header
source: Captcha
ru: Капча

# Login_txtCaptcha1.Header
source: Captcha
ru: Капча

# Login_txtLogin0.Header
source: Username
ru: Имя пользователя

# Login_txtLogin1.Header
source: Username
ru: Имя пользователя

# Notification.Header
source: Notification
ru: Уведомление

# Notification_cmdTelegramBotAddUser.Content
source: Add user
ru: Добавить пользователя

# Notification_cmdTelegramBotDeleteUser.Content
source: Delete user
ru: Удалить пользователя

# Notification_lblTelegramBotCount.Text
source: Number of connected to bot
ru: Количество подключённых к боту

# Notification_lblTelegramBotDashboardName.Text
source: Name of this Dashboard
ru: Имя этой панели мониторинга

# Notification_lblTelegramBotDashboardNameError.Text
source: Think the name of this dashboard to indicate it in bot messages
ru: Придумайте имя этой панели управления для указания его в сообщениях бота

# Notification_lblTelegramBotDescription11.Text
source: Brief description
ru: Краткое описание

# Notification_lblTelegramBotDescription12.Text
source: 1. Dashboard Mining takes commands from the Telegram Bot and sends back the answers
ru: 1. Dashboard Mining принимает команды от бота Telegram и отправляет назад ответы

# Notification_lblTelegramBotDescription13.Text
source: 2. You can manage the state of the farms using Dashboard Mining and the Telegram Bot
ru: 2. Вы можете управлять состоянием ферм с помощью Dashboard Mining и бота Telegram

# Notification_lblTelegramBotDescription14.Text
source: 3. You need to create and configure your Telegram Bot (it will take a few minutes)
ru: 3. Вам необходимо создать и настроить своего бота Telegram (это займёт несколько минут)

# Notification_lblTelegramBotDescription21.Text
source: Description of Telegram Bot features
ru: Описание возможностей бота Telegram

# Notification_lblTelegramBotDescription22.Text
source: 1. User authorization by phone number
ru: 1. Авторизация пользователей по номеру телефона

# Notification_lblTelegramBotDescription23.Text
source: 2. Get users notifications about farm events
ru: 2. Получение пользователями уведомлений о событиях с фермами

# Notification_lblTelegramBotDescription31.Text
source: List of Telegram Bot commands
ru: Список команд бота Telegram

# Notification_lblTelegramBotDescription32.Text
source: 1. /start - Authorize users by phone number to receive notifications
ru: 1. /start - Авторизация пользователей по номеру телефона для получения уведомлений

# Notification_lblTelegramBotDescription41.Text
source: Setting up the Telegram Bot
ru: Настройка бота Telegram

# Notification_lblTelegramBotDescription42.Text
source: 1. Create a Telegram Bot. Official link to create a Telegram Bot:
ru: 1. Создайте бота Telegram. Официальная ссылка по созданию бота Telegram:

# Notification_lblTelegramBotDescription43.Text
source: 2. Add the bot command /start. Set the description of this command, comfortable for you
ru: 2. Добавьте боту команду /start. Установите описание этой команды, удобное для Вас

# Notification_lblTelegramBotDescription44.Text
source: 3. Add the bot command /check. Set the description of this command, comfortable for you
ru: 3. Добавьте боту команду /check. Установите описание этой команды, удобное для Вас

# Notification_lblTelegramBotDescription45.Text
source: 4. Find the token of the bot created and copy it to the Clipboard
ru: 4. Найдите токен созданного бота и скопируйте его в буфер обмена

# Notification_lblTelegramBotDescription46.Text
source: 5. In the Dashboard Mining on the 'Notification' tab:
ru: 5. В Dashboard Mining на закладке 'Уведомление':

# Notification_lblTelegramBotDescription47.Text
source: - Enable 'Notify in Telegram Bot'
ru: - Включите 'Уведомлять в бот Telegram'

# Notification_lblTelegramBotDescription48.Text
source: - Fill in 'Name of this Dashboard'
ru: - Заполните поле 'Имя этой панели мониторинга'

# Notification_lblTelegramBotDescription49.Text
source: - Insert the bot token from the Clipboard in the 'Bot token' field
ru: - Вставьте токен бота из буфера обмена в поле 'Токен бота'

# Notification_lblTelegramBotList.Text
source: Bot users
ru: Пользователи бота

# Notification_lblTelegramBotPhoneError.Text
source: The user's phone must not be empty
ru: Телефон пользователя не должен быть пустым

# Notification_lblTelegramBotToken.Text
source: Bot token
ru: Токен бота

# Notification_lblTelegramBotTokenError.Text
source: The bot token cannot be empty
ru: Токен бота не должен быть пустым

# Notification_tsTelegramBot.Header
source: Notify to Telegram Bot
ru: Уведомлять в бот Telegram

# Notification_txtTelegramBotDashboardName.PlaceholderText
source: Easy to read name of this Dashboard
ru: Понимаемое имя панели мониторинга

# Settings_FanOnVideocardIsWeak.Text
source: Fan speed on the video card is less than
ru: Вентилятор на видеокарте вращается меньше, чем на

# Settings_FanOnVideocardSpinsHard.Text
source: Fan speed on the video card is greater than
ru: Вентилятор на видеокарте вращается больше, чем на

# Settings_NotAllVideocardsWork.Text
source: Not all video cards work
ru: Не все видеокарты работают

# Settings_VideocardSpeedSlowly.Text
source: Video card speed is less than
ru: Скорость видеокарты меньше, чем

# Settings_VideocardTemperatureHigh.Text
source: Video card temperature is greater than
ru: Температура видеокарты больше, чем

# Settings_VideocardTemperatureLow.Text
source: Video card temperature is less than
ru: Температура видеокарты меньше, чем

# FarmAction_Notification
source: Notification
ru: Уведомление

# FarmAction_RebootTheRig
source: Reboot
ru: Перезагрузка

# FarmAction_TakeNoAction
source: Take no action
ru: Нет действия

# Problem_FanOnVideocardIsWeak
source: The fan on video card is weak
ru: Вентилятор видеокарты крутится слабо

# Problem_FanOnVideocardSpinsHard
source: The fan on the video card rotates quickly
ru: Вентилятор видеокарты крутится сильно

# Problem_FarmNotAvailable
source: The farm is not available
ru: Ферма недоступна

# Problem_NoFanDataOnVideocards
source: No fan data on video card
ru: Нет данных о вентиляторах на видеокартах

# Problem_NotAllVideocardsWork
source: Not all video cards work
ru: Работают не все видеокарты

# Problem_NoVideocardSpeedInfo
source: No video card speed info
ru: Нет данных о скорости видеокарт

# Problem_NoVideocardTemperatureInformation
source: No video card temperature Information
ru: Нет данных о температуре видеокарт

# Problem_VideocardSlow
source: The video card is slow
ru: Видеокарта работает медленно

# Problem_VideocardTemperatureHigh
source: Temperature of video card is high
ru: Температура видеокарты высокая

# Problem_VideocardTemperatureLow
source: Temperature of video card is low
ru: Температура видеокарты низкая

# Main_Rigs_Error_Get
source: Failed to get list of farms for
ru: Ошибка получения списка ферм для

# Main_Rigs_Error_Parse
source: Failed to parse farm list for
ru: Ошибка разбора списка ферм для

# Main_Rigs_Error_Check
source: Farm data validation failed
ru: Ошибка проверки параметров фермы

# Notification_Format1
source: Source: {0}, Group: {1}, Name: {2}, Problem: {3}, Duration: {4}, Action: {5}, IP: {6}, Details: {7}
ru: Источник: {0}, Группа: {1}, Имя: {2}, Проблема: {3}, Длительность: {4}, Действие: {5}, IP: {6}, Подробно: {7}

# Notification_Format2
source: Source: {0}, Details: {1}
ru: Источник: {0}, Подробно: {1}

# Notification_Format3
source: Source: {0}, Group: {1}, Name: {2}, Problem: {3}, Duration: {4}, Action: {5}, IP: {6}
ru: Источник: {0}, Группа: {1}, Имя: {2}, Проблема: {3}, Длительность: {4}, Действие: {5}, IP: {6}

# Event_LogClear1
source: Are you sure you want to clear the events?
ru: Вы действительно хотите очистить журнал?

# Event_LogClear2
source: Log events recovery is not possible. Clear log events?
ru: Восстановление журнала невозможно. Очистить журнал?

# Event_LogCopy
source: The selected rows are copied to the Clipboard
ru: Выделенные строки скопированы в буфер обмена

# Event_LogDelete
source: Are you sure you want to delete the selected rows?
ru: Вы действительно хотите удалить выделенные строки?

# Dialog_No
source: No
ru: Нет

# Dialog_Yes
source: Yes
ru: Да

# TelegramBot_AddUser
source: This phone number is already there
ru: Такой номер телефона уже есть в списке

# TelegramBot_DeleteUser
source: Are you sure to delete the selected phone number?
ru: Удалить выбранный телефонный номер?

source: Error login
ru: Ошибка входа

source: Error logout
ru: Ошибка выхода

# Error_Captcha
source: Error get captcha
ru: Ошибка получения капчи

# Error.Header
source: Errors
ru: Ошибки

# Error_Clear.Label
source: Clear all
ru: Очистить все

# Error_LogClear
source: Are you sure you want to clear the errors?
ru: Вы действительно хотите очистить ошибки?

# About_Privacy.Text
source: PRIVACY POLICY
ru: ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ

# Notification_Format4
source: Source: {0}, Group: {1}, Name: {2}, Problem: {3}, Duration: {4}, IP: {5}, Details: {6}
ru: Источник: {0}, Группа: {1}, Имя: {2}, Проблема: {3}, Длительность: {4}, IP: {5}, Подробно: {6}

# Notification_Format5
source: Source: {0}, Group: {1}, Name: {2}, Problem: {3}, Duration: {4}, IP: {5}
ru: Источник: {0}, Группа: {1}, Имя: {2}, Проблема: {3}, Длительность: {4}, IP: {5}

# Notification_lblTelegramBotDescription50.Text
source: - Add the phone numbers of the users who will interact with Telegram Bot
ru: - Добавьте телефонные номера пользователей, которые будут взаимодействовать с ботом

# Notification_lblTelegramBotDescription33.Text
source: 2. /check - Check current state of farms
ru: 2. /check - Проверка текущего состояния ферм

# Notification_lblTelegramBotDescription24.Text
source: 3. Check current state of farms
ru: 3. Проверка текущего состояния ферм
